{
  "backend/main.mo": "Motoko backend actor defining Address, Booking, ShipmentDetails, and PincodeCheckResult types with functions to book shipments, track by ID, and retrieve all bookings stored in a Map.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: removal of PaymentSection component, deletion of PaymentSection.tsx file, and immediate WhatsApp redirect after booking submission.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, and configuration for the Navixa Express shipment booking application.",
  "frontend/index.css": "Tailwind CSS base styles with custom CSS variables for light and dark themes using OKLCH color system for consistent blue and orange branding.",
  "frontend/index.html": "HTML entry point for the Navixa Express React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root React component managing modal states for booking and tracking, rendering hero, about, contact, and footer sections with event handlers for CTA buttons.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying company mission, 50+ customers achievement, and three value proposition cards with icons for small business support, customer trust, and fast service.",
  "frontend/src/components/BookingModal.tsx": "Dialog modal with shipment booking form collecting sender, receiver, and shipment details that immediately redirects to WhatsApp and closes upon successful submission without showing payment UI.",
  "frontend/src/components/ContactSection.tsx": "Contact section displaying clickable cards for phone, WhatsApp, email, and physical address with appropriate icons and hover effects.",
  "frontend/src/components/Footer.tsx": "Footer component with copyright notice and attribution link to caffeine.ai including UTM tracking parameters based on hostname.",
  "frontend/src/components/HeroSection.tsx": "Hero section component displaying Navixa Express branding with logo, tagline, and three CTA buttons (Book Shipment, Track Shipment, Contact WhatsApp) over a gradient background with overlay image.",
  "frontend/src/components/PaymentSection.tsx": "Empty file with no content.",
  "frontend/src/components/PincodeCheck.tsx": "Empty file with no content.",
  "frontend/src/components/TrackShipmentModal.tsx": "Modal dialog component for tracking shipments by booking ID, displaying booking details including sender/receiver information, shipment status, and formatted timestamps using the useTrackShipment hook.",
  "frontend/src/hooks/useActor.ts": "React Query hook that manages the backend actor instance, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBookingForm.ts": "Custom hook managing shipment booking form state (sender, receiver, shipment details), form submission to backend actor, and handling loading/success/error states with form reset functionality.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing AuthClient creation, login/logout flows, identity persistence, and providing authentication status states throughout the application.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/hooks/useTrackShipment.ts": "Custom hook for tracking shipments by booking ID using the backend actor, managing loading/error states and providing tracking data with reset functionality.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining color schemes for UI components including primary/secondary colors, borders, backgrounds, and sidebar styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication, rendering the main App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space (including blue, orange, sidebar, chart colors), container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for Navixa Express courier/logistics website tracking architectural decisions (modal booking form, WhatsApp integration, blue/orange theme, payment options removed) and existing features including homepage, booking form, pincode validation, and WhatsApp redirect functionality."
}